
from typing import List
from icecream import ic
import wandb
from copy import deepcopy
data = {
	#'stable model': [[3, 2.06, 0.87], 	[2, 1.93, 0.9], 	[1, 0.63, 0.87]],
	#'independent':  [[3, 2.37, 0.8], 	[2, 0.97, 0.97], 	[1, 0.57, 0.8]],
	#'dependent':    [[3, 1.53, 0.67], 	[2, 2.77, 0.7], 	[1, 1.47, 0.8]],

	#'critic_large': [[3, 0.97, 0.8], 	[2, 1.5, 0.9], 		[1, 0.53, 0.87]],
	#'policy_large': [[3, 1.83, 0.77], 	[2, 1.2, 0.77], 	[1, 0.8, 0.93]],
	#'small_model':  [[3, 0.27, 0.63], 	[2, 0.3, 0.7], 		[1, 0.26, 0.87]],
	#'big_model':    [[3, 1.8, 0.8], 	[2, 1.26, 1], 		[1, 1.1, 0.9]],
	#'merge_model':  [[3, 0.1, 1], 		[2, 0.06, 1], 		[1, 1.93, 0.87]],
	#'split_model':  [[3, 1.87, 0.57], 	[2, 1.73, 0.87], 	[1, 1.63, 0.73]],
	'model_goal_split': [[], [], []],
	#'spot_model_thin':  [[3, 1.73, 0.7], [2, 0.77, 0.93], 	[1, 1.83, 0.73]],

	'map_frame':    [[], [], []],
	'lidar_less':   [[], [], []],
	'state_no_noise':   [[], [], []], 
	'state_distance':   [[], [], []],

	#'ppo':          [[3, 2.13, 0.7], 	[2, 1.4, 0.83], 	[1, 1.06, 0.83]],
	'old_a2c':      [[], [], []],
	
	#'11 action':    [[3, 1.63, 0.73], 	[2, 1, 0.87], 		[1, 1.56, 0.9]],  # m l
	#'19 action':    [[3, 2.9, 0.73], 	[2, 1.6, 0.83], 	[1, 1.83, 0.83]], # m l
	'7 action':     [[], [], []],
	#'action_direct':[[3, 1.23, 0.97], 	[2, 0.33, 0.97], 	[1, 1.43, 0.87]],
	#'speed_circle': [[3, 1.4, 0.87], 	[2, 2.23, 0.83], 	[1, 1.67, 0.87]],
	#'init speed':   [[3, 0.6, 0.93], 	[2, 0.97, 0.97], 	[1, 1.7, 0.83]],
	#'gravity_error':[[3, 1.83, 0.83], 	[2, 0.7, 0.8], 		[1, 1.17, 1]],
	#'entropy_low':  [[3, 1.33, 0.87], 	[2, 1.37, 0.73], 	[1, 1.13, 0.87]],
	#'entrop_zero':  [[3, 0, 1], 		[2, 0.17, 0.5], 	[1, 0.17, 0.7]],
	'entrop_same':  [[], [], []],
	'entropy_balance':  [[], [], []], 
	#'random map f': [[3, 3.03, 0.43], 	[2, 1.63, 0.77], 	[1, 0.73, 0.83]],
	'random agent f':   [[], [], []],
	#'rand mapagent f':[[3, 0.9, 0.9], 	[2, 1.3, 0.67], 	[1, 1.57, 0.9]],
	#'phase v126':   [[3, 1.17, 0.9], 	[2, 1.2, 0.83], 	[1, 0.6, 1]],
	#'phase v136':   [[3, 1.37, 0.9], 	[2, 0.53, 0.93], 	[1, 1.43, 1]],
	#'phase all 3':  [[3, 1.8, 0.7], 	[2, 1.03, 0.76], 	[1, 1.23, 0.87]],
	#'low_env_h_agent':  [[3, 0.67, 0.97],[2, 0.83, 0.73], 	[1, 0.9, 0.87]],
	#'gamma86_30':   [[3, 2.06, 0.87], 	[2, 1.93, 0.9], 	[1, 0.63, 0.87]],
	#'gamma86_50':   [[3, 2, 0.77], 		[2, 2.33, 0.7], 	[1, 2.06, 0.9]],
	#'gamma97_30':   [[3, 0.53, 0.83], 	[2, 0.43, 0.8], 	[1, 0.13, 0.8]],
	#'gamma97_50':   [[3, 0.73, 0.93], 	[2, 0.6, 0.83], 	[1, 1.07, 0.87]],
	#'gamma91_30':   [[3, 0.56, 0.7], 	[2, 0.83, 0.87], 	[1, 0.67, 0.87]],
	'gamma91_50':   [[3, 3.8, 0.58], [], []],
	'final_costom':    [[3, 1.83, 0.88], [2, 2.75, 0.85], 	[1, 0.2, 0.9]],
	'final_fc_model':  [[3, 1.93, 0.53], [2, 2.53, 0.83], 	[1, 1.57, 0.83]],
}
def main():
	for run_data in data:
		if not data[run_data][0]: continue
		run = wandb.init(project='custom-charts', name=run_data)
		data[run_data][0]
		table = wandb.Table(data=data[run_data], columns=["phase", "get goal p", "hit p"])
		histogram = wandb.plot.histogram(table, value='Value', title='Effect display')
		wandb.log({'Effect display': histogram})

		# 结束 W&B 运行
		run.finish()


		print(run_data, data[run_data])
if __name__ == "__main__":
	main()

